spec/cassettes/apply_vat_success.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=12&card[exp_year]=30&card[cvc]=222&metadata[country_code]=NL&metadata[is_company]=false&metadata[other]=random
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '156'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Jul 2014 14:03:26 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1396'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Stripe-Version:
      - '2014-03-13'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1406383406,
          "id": "cus_4TShhHJxgNR8pO",
          "livemode": false,
          "description": null,
          "email": null,
          "delinquent": false,
          "metadata": {
            "country_code": "NL",
            "is_company": "false",
            "other": "random"
          },
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_4TShhHJxgNR8pO/subscriptions",
            "data": [],
            "count": 0
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4TShhHJxgNR8pO/cards",
            "data": [
              {
                "id": "card_14KVli2nHroS7mLXAeqB5P87",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2030,
                "fingerprint": "0K7oMWAQAFG7TEob",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4TShhHJxgNR8pO",
                "type": "Visa"
              }
            ],
            "count": 1
          },
          "default_card": "card_14KVli2nHroS7mLXAeqB5P87"
        }
    http_version: 
  recorded_at: Sat, 26 Jul 2014 14:03:26 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoiceitems
    body:
      encoding: US-ASCII
      string: customer=cus_4TShhHJxgNR8pO&amount=100&currency=usd
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '51'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Jul 2014 14:03:27 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '292'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "invoiceitem",
          "id": "ii_14KVlj2nHroS7mLXdsvpSO6W",
          "date": 1406383407,
          "amount": 100,
          "livemode": false,
          "proration": false,
          "currency": "usd",
          "customer": "cus_4TShhHJxgNR8pO",
          "description": null,
          "metadata": {},
          "invoice": null,
          "subscription": null
        }
    http_version: 
  recorded_at: Sat, 26 Jul 2014 14:03:27 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoices
    body:
      encoding: US-ASCII
      string: customer=cus_4TShhHJxgNR8pO
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '27'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Jul 2014 14:03:28 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1265'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "date": 1406383408,
          "id": "in_14KVlk2nHroS7mLXFziU3lgU",
          "period_start": 1406383408,
          "period_end": 1406383408,
          "lines": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/invoices/in_14KVlk2nHroS7mLXFziU3lgU/lines",
            "data": [
              {
                "id": "ii_14KVlj2nHroS7mLXdsvpSO6W",
                "object": "line_item",
                "type": "invoiceitem",
                "livemode": false,
                "amount": 100,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1406383407,
                  "end": 1406383407
                },
                "quantity": null,
                "plan": null,
                "description": null,
                "metadata": {}
              }
            ],
            "count": 1
          },
          "subtotal": 100,
          "total": 100,
          "customer": "cus_4TShhHJxgNR8pO",
          "object": "invoice",
          "attempted": false,
          "closed": false,
          "forgiven": false,
          "paid": false,
          "livemode": false,
          "attempt_count": 0,
          "amount_due": 100,
          "currency": "usd",
          "starting_balance": 0,
          "ending_balance": null,
          "next_payment_attempt": 1406387008,
          "webhooks_delivered_at": null,
          "charge": null,
          "discount": null,
          "application_fee": null,
          "subscription": null,
          "metadata": {},
          "statement_description": null,
          "description": null
        }
    http_version: 
  recorded_at: Sat, 26 Jul 2014 14:03:28 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_4TShhHJxgNR8pO
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Jul 2014 14:03:29 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1397'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Stripe-Version:
      - '2014-03-13'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1406383406,
          "id": "cus_4TShhHJxgNR8pO",
          "livemode": false,
          "description": null,
          "email": null,
          "delinquent": false,
          "metadata": {
            "country_code": "NL",
            "is_company": "false",
            "other": "random"
          },
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_4TShhHJxgNR8pO/subscriptions",
            "data": [],
            "count": 0
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4TShhHJxgNR8pO/cards",
            "data": [
              {
                "id": "card_14KVli2nHroS7mLXAeqB5P87",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2030,
                "fingerprint": "0K7oMWAQAFG7TEob",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4TShhHJxgNR8pO",
                "type": "Visa"
              }
            ],
            "count": 1
          },
          "default_card": "card_14KVli2nHroS7mLXAeqB5P87"
        }
    http_version: 
  recorded_at: Sat, 26 Jul 2014 14:03:29 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/account
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Jul 2014 14:03:30 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1878'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Stripe-Version:
      - '2014-03-13'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "acct_102w3g2nHroS7mLX",
          "email": "admin@piesync.com",
          "statement_descriptor": "PIESYNC.COM",
          "display_name": "Piesync",
          "timezone": "Etc/UTC",
          "details_submitted": true,
          "charge_enabled": true,
          "transfer_enabled": true,
          "currencies_supported": [
            "usd",
            "aed",
            "afn",
            "all",
            "amd",
            "ang",
            "aoa",
            "ars",
            "aud",
            "awg",
            "azn",
            "bam",
            "bbd",
            "bdt",
            "bgn",
            "bif",
            "bmd",
            "bnd",
            "bob",
            "brl",
            "bsd",
            "bwp",
            "bzd",
            "cad",
            "cdf",
            "chf",
            "clp",
            "cny",
            "cop",
            "crc",
            "cve",
            "czk",
            "djf",
            "dkk",
            "dop",
            "dzd",
            "eek",
            "egp",
            "etb",
            "eur",
            "fjd",
            "fkp",
            "gbp",
            "gel",
            "gip",
            "gmd",
            "gnf",
            "gtq",
            "gyd",
            "hkd",
            "hnl",
            "hrk",
            "htg",
            "huf",
            "idr",
            "ils",
            "inr",
            "isk",
            "jmd",
            "jpy",
            "kes",
            "kgs",
            "khr",
            "kmf",
            "krw",
            "kyd",
            "kzt",
            "lak",
            "lbp",
            "lkr",
            "lrd",
            "lsl",
            "ltl",
            "lvl",
            "mad",
            "mdl",
            "mga",
            "mkd",
            "mnt",
            "mop",
            "mro",
            "mur",
            "mvr",
            "mwk",
            "mxn",
            "myr",
            "mzn",
            "nad",
            "ngn",
            "nio",
            "nok",
            "npr",
            "nzd",
            "pab",
            "pen",
            "pgk",
            "php",
            "pkr",
            "pln",
            "pyg",
            "qar",
            "ron",
            "rsd",
            "rub",
            "rwf",
            "sar",
            "sbd",
            "scr",
            "sek",
            "sgd",
            "shp",
            "sll",
            "sos",
            "srd",
            "std",
            "svc",
            "szl",
            "thb",
            "tjs",
            "top",
            "try",
            "ttd",
            "twd",
            "tzs",
            "uah",
            "ugx",
            "uyu",
            "uzs",
            "vef",
            "vnd",
            "vuv",
            "wst",
            "xaf",
            "xcd",
            "xof",
            "xpf",
            "yer",
            "zar",
            "zmw"
          ],
          "default_currency": "eur",
          "country": "BE",
          "object": "account"
        }
    http_version: 
  recorded_at: Sat, 26 Jul 2014 14:03:30 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoiceitems
    body:
      encoding: US-ASCII
      string: customer=cus_4TShhHJxgNR8pO&invoice=in_14KVlk2nHroS7mLXFziU3lgU&amount=21&currency=usd&description=VAT%20(21%25)
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '112'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Jul 2014 14:03:31 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '323'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "invoiceitem",
          "id": "ii_14KVln2nHroS7mLXE2wQ5qdl",
          "date": 1406383411,
          "amount": 21,
          "livemode": false,
          "proration": false,
          "currency": "usd",
          "customer": "cus_4TShhHJxgNR8pO",
          "description": "VAT (21%)",
          "metadata": {},
          "invoice": "in_14KVlk2nHroS7mLXFziU3lgU",
          "subscription": null
        }
    http_version: 
  recorded_at: Sat, 26 Jul 2014 14:03:31 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoices/in_14KVlk2nHroS7mLXFziU3lgU
    body:
      encoding: US-ASCII
      string: metadata[country_code]=NL&metadata[is_company]=false&metadata[other]=random&metadata[vat_amount]=21&metadata[vat_rate]=21
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '121'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Jul 2014 14:03:32 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1814'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Stripe-Version:
      - '2014-03-13'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "date": 1406383408,
          "id": "in_14KVlk2nHroS7mLXFziU3lgU",
          "period_start": 1406383408,
          "period_end": 1406383408,
          "lines": {
            "object": "list",
            "total_count": 2,
            "has_more": false,
            "url": "/v1/invoices/in_14KVlk2nHroS7mLXFziU3lgU/lines",
            "data": [
              {
                "id": "ii_14KVlj2nHroS7mLXdsvpSO6W",
                "object": "line_item",
                "type": "invoiceitem",
                "livemode": false,
                "amount": 100,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1406383407,
                  "end": 1406383407
                },
                "quantity": null,
                "plan": null,
                "description": null,
                "metadata": {}
              },
              {
                "id": "ii_14KVln2nHroS7mLXE2wQ5qdl",
                "object": "line_item",
                "type": "invoiceitem",
                "livemode": false,
                "amount": 21,
                "currency": "usd",
                "proration": false,
                "period": {
                  "start": 1406383411,
                  "end": 1406383411
                },
                "quantity": null,
                "plan": null,
                "description": "VAT (21%)",
                "metadata": {}
              }
            ],
            "count": 2
          },
          "subtotal": 121,
          "total": 121,
          "customer": "cus_4TShhHJxgNR8pO",
          "object": "invoice",
          "attempted": false,
          "closed": false,
          "forgiven": false,
          "paid": false,
          "livemode": false,
          "attempt_count": 0,
          "amount_due": 121,
          "currency": "usd",
          "starting_balance": 0,
          "ending_balance": null,
          "next_payment_attempt": 1406387008,
          "webhooks_delivered_at": null,
          "charge": null,
          "discount": null,
          "application_fee": null,
          "subscription": null,
          "metadata": {
            "country_code": "NL",
            "is_company": "false",
            "other": "random",
            "vat_amount": "21",
            "vat_rate": "21"
          },
          "statement_description": null,
          "description": null
        }
    http_version: 
  recorded_at: Sat, 26 Jul 2014 14:03:32 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/invoices?customer=cus_4TShhHJxgNR8pO
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19
        22:22:27 PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 26 Jul 2014 14:03:33 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2226'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-03-13'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "list",
          "has_more": false,
          "url": "/v1/invoices",
          "data": [
            {
              "date": 1406383408,
              "id": "in_14KVlk2nHroS7mLXFziU3lgU",
              "period_start": 1406383408,
              "period_end": 1406383408,
              "lines": {
                "object": "list",
                "total_count": 2,
                "has_more": false,
                "url": "/v1/invoices/in_14KVlk2nHroS7mLXFziU3lgU/lines",
                "data": [
                  {
                    "id": "ii_14KVlj2nHroS7mLXdsvpSO6W",
                    "object": "line_item",
                    "type": "invoiceitem",
                    "livemode": false,
                    "amount": 100,
                    "currency": "usd",
                    "proration": false,
                    "period": {
                      "start": 1406383407,
                      "end": 1406383407
                    },
                    "quantity": null,
                    "plan": null,
                    "description": null,
                    "metadata": {}
                  },
                  {
                    "id": "ii_14KVln2nHroS7mLXE2wQ5qdl",
                    "object": "line_item",
                    "type": "invoiceitem",
                    "livemode": false,
                    "amount": 21,
                    "currency": "usd",
                    "proration": false,
                    "period": {
                      "start": 1406383411,
                      "end": 1406383411
                    },
                    "quantity": null,
                    "plan": null,
                    "description": "VAT (21%)",
                    "metadata": {}
                  }
                ],
                "count": 2
              },
              "subtotal": 121,
              "total": 121,
              "customer": "cus_4TShhHJxgNR8pO",
              "object": "invoice",
              "attempted": false,
              "closed": false,
              "forgiven": false,
              "paid": false,
              "livemode": false,
              "attempt_count": 0,
              "amount_due": 121,
              "currency": "usd",
              "starting_balance": 0,
              "ending_balance": null,
              "next_payment_attempt": 1406387008,
              "webhooks_delivered_at": null,
              "charge": null,
              "discount": null,
              "application_fee": null,
              "subscription": null,
              "metadata": {
                "country_code": "NL",
                "is_company": "false",
                "other": "random",
                "vat_amount": "21",
                "vat_rate": "21"
              },
              "statement_description": null,
              "description": null
            }
          ],
          "count": 1
        }
    http_version: 
  recorded_at: Sat, 26 Jul 2014 14:03:33 GMT
recorded_with: VCR 2.9.2
